# tap configuration

tap "homebrew/cask"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"

# packages

brew "python"
brew "ansible"
brew "git"
brew "git-delta"
brew "jq"
brew "yq"
brew "wget"
brew "gh"
brew "glab"
brew "lf"
brew "lazygit"
brew "lazydocker"
brew "m-cli"
brew "docutils"
brew "starship"
brew "glances"
brew "mas"
brew "tree"
brew "thefuck"
brew "btop"
brew "fzf"
brew "tldr"
brew "packer"

# cask

cask "dozer"
cask "font-fira-code"
cask "powershell"
cask "tidal"
cask "sonos"
cask "roon"
cask "brave-browser"
cask "arc"
cask "raycast"
cask "balenaetcher"
cask "beeper"
cask "texts"
cask "discord"
cask "google-drive"
cask "google-chrome"
cask "onedrive"
cask "nordvpn"
cask "marta"
cask "iina"
cask "logi-options-plus"
cask "numi"
cask "sleek"
cask "iglance"
cask "displaylink"
cask "microsoft-teams"
cask "google-chat"
cask "zoom"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "utm"
cask "vagrant"

# mas

mas "Amphetamine", id: 937984704
mas "Grammarly", id: 1462114288
