# tap configuration

tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "felixkratz/formulae"
tap "homebrew/services"

# packages

brew "yabai"
brew "skhd"
brew "borders"
brew "lima"
brew "socket_vmnet"
brew "docker"

# cask

cask "visual-studio-code"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "hyper"
cask "tidal"
cask "sonos"
cask "roon"
cask "whatsapp"
cask "google-chrome"
cask "google-drive"
cask "onedrive"
cask "dozer"
cask "logi-options-plus"
cask "arc"
cask "raycast"
cask "balenaetcher"
cask "discord"
cask "nordvpn"
cask "marta"
cask "iina"
cask "numi"
cask "sleek"
cask "displaylink"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "logitech-g-hub"
cask "bruno"
cask "proxyman"
cask "writerside"
cask "remote-desktop-manager"
cask "lens"
cask "creality-print"
cask "orcaslicer"
cask "autodesk-fusion"
cask "chatgpt"
cask "spotify"