# tap configuration

tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "felixkratz/formulae"
tap "homebrew/services"

# packages

brew "fish"
brew "bash"
brew "starship"
brew "jq"
brew "yq"
brew "wget"
brew "m-cli"
brew "git"
brew "git-extras"
brew "lazygit"
brew "dockutil"
brew "lf"
brew "glances"
brew "mas"
brew "tree"
brew "thefuck"
brew "btop"
brew "fzf"
brew "tldr"
brew "gh"
brew "glab"
brew "fastfetch"
brew "bat"
brew "minicom"
brew "go-task"
brew "k9s"
brew "kubectl"
brew "gettext"
brew "go-task"
brew "iproute2mac"
brew "go"
brew "docker"
brew "kind"
brew "gdu"
brew "borders"
brew "lima"
brew "socket_vmnet"
brew "yabai"
brew "skhd"
brew "ollama"

# cask

cask "arc"
cask "visual-studio-code"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "hyper"
cask "whatsapp"
cask "google-chrome"
cask "google-drive"
cask "dozer"
cask "logi-options-plus"
cask "logitech-g-hub"
cask "raycast"
cask "balenaetcher"
cask "discord"
cask "nordvpn"
cask "iina"
cask "numi"
cask "displaylink"
cask "bruno"
cask "proxyman"
cask "remote-desktop-manager"
cask "lens"
cask "creality-print"
cask "orcaslicer"
cask "autodesk-fusion"
cask "chatgpt"
cask "spotify"
cask "inkscape"
cask "raspberry-pi-imager"
cask "logi-options+"